1c/DataProcessors/json_import.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>json_import</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

1c/Catalogs/leads.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>leads</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>lead_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.source</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>current_stage</Name>
					<Type>
						<v8:Type>cfg:EnumRef.current_stage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>owner_fio</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>created_at</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1c/DataProcessors/json_import/Ext/ObjectModule.bsl
Функция ИмпортJson(ПутьКФайлу) Экспорт         
	
	Ошибки = Новый Массив;
	
	//ЗаписьJSON.ЗаписатьНачалоМассива();
	ЛокальныйПуть = ПутьКФайлу;	
	JSONФайл = Новый ЧтениеJSON;
	JSONФайл.ОткрытьФайл(ЛокальныйПуть);
	Данные = ПрочитатьJSON(JSONФайл);
	JSONФайл.Закрыть();        
	
	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		Для Каждого ЭлементJSON Из Данные Цикл  
			Попытка
				
				СпрСсылка = Справочники.leads.НайтиПоРеквизиту("lead_id", ЭлементJSON.lead_id);
		        
		        Если СпрСсылка.Пустая() Тогда
		           СпрОбъект = Справочники.leads.СоздатьЭлемент();  
			    Иначе 
				   СпрОбъект = СпрСсылка.ПолучитьОбъект();
				КонецЕсли;
				
				СпрОбъект.lead_id = ЭлементJSON.lead_id;  
				
				Источник = ЭлементJSON.source;
				ИсточникПеречисление = Перечисления.source[Источник];
				СпрОбъект.source = ИсточникПеречисление;
				
				Стадия = ЭлементJSON.current_stage;
				СтадияПеречисление = Перечисления.current_stage[Стадия];
				СпрОбъект.current_stage = СтадияПеречисление;
				
				СпрОбъект.owner_fio = ЭлементJSON.owner_fio;
				СтрДата = ЭлементJSON.created_at;
				Если ЗначениеЗаполнено(СтрДата) Тогда						
					День  = Число(Лев(СтрДата, 2));
					Месяц = Число(Сред(СтрДата, 4, 2));
					Год   = Число(Прав(СтрДата, 4));
					СпрОбъект.created_at = Дата(Год, Месяц, День);
				КонецЕсли;
				СпрОбъект.Записать();  
			Исключение          
				ИнфоОшибки = Новый Структура;
				ИнфоОшибки.Вставить("lead_id", ЭлементJSON.lead_id);
				ИнфоОшибки.Вставить("error", ОписаниеОшибки());
				Ошибки.Добавить(ИнфоОшибки);
				//Сообщить("ошибка записи" + ОписаниеОшибки()); 
			КонецПопытки;	
	    КонецЦикла;
	КонецЕсли; 
	
	 ПараметрыЗаписи = Новый ПараметрыЗаписиJSON();
	 JSONошибки = Новый ЗаписьJSON;   
	 JSONошибки.УстановитьСтроку(ПараметрыЗаписи);
     ЗаписатьJSON(JSONошибки, Ошибки);
     РезультатJSON = JSONошибки.Закрыть();
	 Возврат РезультатJSON;      
	 
КонецФункции
